import{_ as i,p as l,q as n,a1 as a}from"./framework-d81ad7e5.js";const e={},r=a(`<h3 id="思路" tabindex="-1"><a class="header-anchor" href="#思路" aria-hidden="true">#</a> 思路</h3><ul><li>目前在做一件什么事情？</li><li>基于什么背景和框架？</li><li>目前做到什么程度？</li><li>遇到什么困难和风险？</li><li>期望有什么结果？</li><li>还期望获得哪些帮助与支持？</li><li>... 等等</li></ul><h3 id="开发" tabindex="-1"><a class="header-anchor" href="#开发" aria-hidden="true">#</a> 开发</h3><ul><li>框架有了没</li><li>搞清楚需求</li><li>看以前有人写过没有，</li><li>参考一下别人写的规范是什么</li><li>说没说让用哪个框架？</li><li>代码从哪下载？</li><li>数据用不用入库</li><li>表是需要自己建，还是怎么着</li><li>按照一定的代码格式</li><li>不要在WEB层写业务逻辑！！！</li></ul><blockquote><p>功能开发完毕后注意这样几个问题：</p></blockquote><ol><li>界面排版：尽量风格统一，包括字体、大小、位置</li><li>注意测试：要充分测试 <ol><li>正常测试</li><li>逻辑测试</li><li>边界测试</li><li>容错测试</li><li>各开发人员之间可进行交叉测试，确保功能正确</li></ol></li><li>项目经理、副经理注意进度把控及对外协调，尽量减少不必要的等待时间</li></ol><ul><li>写代码很难，写好代码更难</li><li>写好代码需要长时间、反复、刻意的练习</li><li>写好代码是一个高度自律的过程</li><li>每次写代码之前或者之后多问几个为什么？ <ul><li>为什么要这么写？</li><li>有没有更加简单直观的写法？</li><li>这段代码其他人看的懂吗？</li><li>这段代码好复用吗？</li></ul></li></ul><ul><li>互联网架构并非靠<strong>设计</strong>出来的，而是经过实战<strong>不断演练而成</strong>，因此经验尤为重要。</li><li>代码量是无法真正权衡水平的，在做需求时多去思考更合理的解决方案、写代码时尽量避免重复劳动，才是我们要追求的。</li><li>实际软件工程项目中，模块切分的太大则会产生模块化不足的现象，模块切分的太小则会陷入过度模块化陷阱。</li><li>模块化不足会让你的项目失去灵活性，并且与业务高度耦合，相同的代码不得不写多次才能实现同样的功能；而过度模块化则会让程序员记忆成本增加，并可能出现只有在特定情形下多个模块组合才能达成某个目的的“魔法组合方式”，不利于维护。</li><li>随着业务的变化、系统设计也要<strong>持续演进升级</strong>。没有一开始就完美的架构， 好的架构设计一定是<strong>演化</strong>来的，不是<strong>一开始就设计</strong>出来的。</li></ul><h2 id="时间" tabindex="-1"><a class="header-anchor" href="#时间" aria-hidden="true">#</a> 时间</h2><h3 id="一个人有多少时间" tabindex="-1"><a class="header-anchor" href="#一个人有多少时间" aria-hidden="true">#</a> 一个人有多少时间？</h3><p>今天的事情你可以明天做，明天的事情你也可以后天做。往往很多人特别看中手里的金钱，觉得时间反而是廉价的东西。 我做事情不喜欢拖拉，时间过去了是没有东西可以弥补的。</p><p>一个人有多少时间？赵本山在他的小品里说过。人能活三万六千天，大约一百年。可谁又有一百年？七十的都算是福了。 去掉睡觉吃饭的一半，工作生活还有多少？时间对我们来说是很宝贵的，我们没有任何理由去浪费时间。我们回想一下我们是否觉得儿时仿佛再昨天？</p><p>慢慢的我懂得了答应别人的事要赶紧做完，浪费别人的时间是谋杀。自己的事情也要再规定时间内完成。遵守时间是一种美德，是对他人负责更是对自己负责。</p><p>去应聘你过了时间，用人单位便不会等你。你谈客户让客户等三两个小时，我估计也没什么好谈的了。时间真的很宝贵，对我们自己很重要；对于其他人也很重要。</p><p>我们会发现大家都再为自己的时间做着各种努力，不管你是那个行业的人。唯一不同的是选择的路径是否适合自己，并不一定每个人都会看的很清楚。</p><p>往往很多人特别看中手里的金钱，觉得时间反而是廉价的东西。生活中有很多等廉价机票；等廉价火车；等廉价的免费商品。只要不花钱多等一会没问题。</p><p>我们有时候要反思一下，为什么很多人有行程表？而我们没有。是因为我们不会做行程表吗？不是的！是我们懒得去做，一切没有计划不挺好的吗。我们就在这种随遇而安的生活中一点点消磨时间。真正有意义或者自己喜欢的事情一样没做。</p><p>我珍惜别人的时间，我更珍惜我自己的时间。我做事情不喜欢拖拉，时间过去了是没有东西可以弥补的。一寸光阴一寸金，寸金难买寸光阴。我们应珍惜时光，而不可虚度年华。</p><p>后悔是没有用的。我这人从来不后悔，我觉得这是没有用的事情。比起后悔不如做好下一件事情，只要天不塌下来还有什么可闹心的呢？</p><p>想一百次、说一百次、真的不如做一次……因为时间过去了，真的不会再来！</p><blockquote><p>做人不要太浅做人，你的情绪不要一点火就着，一滴水就灭，一碰到点儿事儿就想惊天动地，加了两天班就希望别人知道你有多辛苦，认识一个人三两天，他就知道你家里几亩地，地里几头牛，与别人一言不合，就要发朋友圈和别人争吵不休，随便遇到个人对你好。梦想就从山川湖海变成厨房与爱。，去趟西藏就大彻大悟洗涤灵魂了。这样的人，实在很容易大喜大悲，也很容易受伤。所以要学着做一个有温度且睿智的人，不相为谋。，我照样能心平气和，冷眼相待，我照样可以风生水起。</p></blockquote><h2 id="不可逆加密-hash算法" tabindex="-1"><a class="header-anchor" href="#不可逆加密-hash算法" aria-hidden="true">#</a> 不可逆加密 (Hash算法)</h2><div class="language-text" data-ext="text"><pre class="language-text"><code>阿呆： 小星，你看这样可以不，我想一个A，经过下面的过程：


1.A+123=B


2.B^2=C


3.取C中第2~4位数，组成一个3位数D


4.D/12的结果求余数，得到E


阿呆：我把E和上述计算方式都告诉你，你猜A是奇数还是偶数，然后我告诉你A是多少，你可以按上述的计算过程来验证我是否有说谎。


小星： 嗯，我想想，假如你想的A为5，那么：


5+123=128


128^2=16384


D=638 E=638mod12=53


(mod表示除法的求余数)


小星：咦，厉害了，一个A值对应一个唯一的E值，根据E还推算不出来A。你太贱了，好吧，这个算公平，谁撒谎都能被识别出来。


小星：阿呆，你出题吧 ……


这种丢掉一部分信息的加密方式称为“单向加密”，也叫哈希算法。
</code></pre></div><h2 id="最后" tabindex="-1"><a class="header-anchor" href="#最后" aria-hidden="true">#</a> 最后</h2><h4 id="如果你想和我聊人生那就联系我吧-我不是你没办法规划你的人生。但我可以在你的人生之路上陪你走那么一小段" tabindex="-1"><a class="header-anchor" href="#如果你想和我聊人生那就联系我吧-我不是你没办法规划你的人生。但我可以在你的人生之路上陪你走那么一小段" aria-hidden="true">#</a> 如果你想和我聊人生那就联系我吧，我不是你没办法规划你的人生。但我可以在你的人生之路上陪你走那么一小段...</h4>`,25),t=[r];function h(d,o){return l(),n("div",null,t)}const c=i(e,[["render",h],["__file","bibi1.html.vue"]]);export{c as default};
