import{_ as l,p as n,q as e,a1 as i}from"./framework-d81ad7e5.js";const t={},p=i(`<div class="language-text" data-ext="text"><pre class="language-text"><code> 怎么了你们
如果不想说的话
也没关系 &lt;br&gt;

不请自来如果她问我
我会告诉她:
你的名字有30划。
你在我的手机里有41张照片,其中有6张是我们的合影。
还有48个聊天时我偷偷保存下来的视频,你笑了四次,亲了我七口,一共说了112个字。
我们分手了,我在这里写下这个回答,可能是想让你未来看见时,心里能有一点涟漪吧,哪怕几率微乎其微。
</code></pre></div><ul><li><p>我在你面前我就会不知所措，我就会紧张</p></li><li><p>可能我不能理解你，但我尊重你，我希望你开心 那你开心我也超级开心</p></li><li><p>“要是疼在我身上就好了。”</p></li><li><p>送给你 做我女朋友吧 你是单身吗 那你找男朋友有没有什么标准 我问你个问题啊 你喜欢我吗 你为什么不喜欢我 如果我追你的话 就假如说我追你 我想跟你谈恋爱 你会 你愿意跟我在一起吗</p></li><li><p>每天晚上道晚安以后他总还有一句，“睡不着的话给我打电话，我开了声音。”</p></li><li><p>幸福来得太突然， 我有点没反应过来</p></li><li><p>我明白，你可能会需要很多时间确认，但你放心，我对你一直都有答复</p></li></ul><div class="language-text" data-ext="text"><pre class="language-text"><code>
我对你，喜欢绝对有，不然不会问你，
但理性，我不喜欢黏在对方身边，和对方分享自己喜欢的事绝对没有问题，
但这段时间，我确实不是很有时间，我更喜欢在生活中给你提供有问题的时候的解决方式。
所以，对于我，我算是个阳光的人吧，但也理性一点。很少有冲动做一些事情。
所以，我否定你说我不喜欢的命题。但从你在我身上得到的体验来看，我不完全是你想象中的类型，
有些事情我确实做不到。所以结不结束不完全在我，也在你，可能和我在一起，会收获更多的没有回应的时间和失望，
但我在结束工作的时候，过年期间，空档期陪你，但从距离上讲，我能陪你的也只有聊天了，
所以综上所述，建议及时止损。放心，我不是海王、也没有鱼塘，
从还在上学的时候，我确定恋爱对象一直是你,我随时可以官宣。
除了你，我也没有想恋爱的对象。这个我可以用我的以后的成绩，前途、家人起誓。

心里想说的话都在这儿了
</code></pre></div><p>千万别买，退了吧 我就不！ 要赋予这一天与其它日子不同的 意义 想多花一些心思待你</p><div class="language-text" data-ext="text"><pre class="language-text"><code>好好照顾自己
有任何需要随时联系我
是随时都可以联系哈
我从来不担心你的努力
我希望你永远快乐

好我也是最近可能生活的
乱七八糟的把自己的快乐弄
丢了我肯定会调整好自己的!
</code></pre></div><p>我只希望你开心 或者说我比任何人都希望你开 D 希望你开心的搞学术 开心的谈恋爱 开心的过每一天</p><p>有一种心情叫回家见你</p><p>“你看其实现在你也能帮我很多给我 许多建议 我们都是互相学习彼此进步 的过程真好啊”</p><ul><li><p>如果太想念你 该怎们办才好</p></li><li><p>只是希望今后的你在人生低谷的时候， 不要灰心， 至少曾经有人被你的魅力所吸引</p></li><li><p>我的意思是：你不要把我当成负担，不要费神的为我们去定义什么样的关系，我只是一个喜欢你的人，我对你唯一的要求就是，需要我的时候不要讲反话[比心]</p></li></ul><ul><li>你可以永远相信我</li><li>你今天有点特别啊 特别可爱</li><li>天上的月亮，都不及你呀</li><li>你笑起来 ， 就是好天气</li><li>遇见你， 是我最骄傲的事情</li><li>xxxxxx 我想去找你</li><li>没有什么甜言蜜语，只有一颗和你在一起的心</li><li>你永远胜过别人 至少在我这里</li></ul>`,10),a=[p];function c(s,x){return n(),e("div",null,a)}const o=l(t,[["render",c],["__file","nx.html.vue"]]);export{o as default};
